Revit 2027 API
ViewHVACLoadsReport.Create Method
 Factory method to create a new instance of DBViewHVACLoadsReport.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ViewHVACLoadsReport Create(
	Document document,
	string viewName
)
Public Shared Function Create (
	document As Document,
	viewName As String
) As ViewHVACLoadsReport
public:
static ViewHVACLoadsReport^ Create(
	Document^ document,
	String^ viewName
)
static member Create :
        document : Document *
        viewName : string -> ViewHVACLoadsReport
Parameters
document Document
 The document where the report view is to be created.
viewName String
 The name of the new report view.
Return Value
ViewHVACLoadsReport
 The newly created view instance, or null if the operation fails.
Exceptions
Exception | Condition
ArgumentException |  viewName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- viewName is an empty string.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
ViewHVACLoadsReport Class
Autodesk.Revit.DB.Analysis Namespace